  {
    "metadata": {
      "rank": 3
    },
    "data": {
      "cc": 3000,
      "transmission": "auto",
      "year": 2013,
      "name": "Toyota Landcruiser",
      "drive": "LC300 SAHARA (4x4)",
      "seats": 7,
      "doors": 4,
      "fuelType": "Diesel",
      "description": "The 2022 Land Cruiser Sahara stands out not only for its unparalleled luxury and off-road capability but also for its spacious and versatile seven-seat configuration, making it the ideal choice for families, group outings, or those who simply crave extra room to stretch out and relax.\nWith three rows of sumptuous leather seating, including a spacious third row that comfortably accommodates adults, the Land Cruiser Sahara ensures that every passenger enjoys a first-class experience, whether on a cross-country road trip or a weekend getaway. Plus, with ample cargo space even with all seven seats in use, you'll have plenty of room for luggage, sports gear, or whatever else your adventure demands.\nBut it's not just about space—the Land Cruiser Sahara's seven-seat layout is designed with comfort and convenience in mind. Each seat is meticulously crafted for maximum comfort, with available features like heating and ventilation ensuring everyone stays cozy and refreshed, no matter the weather outside. Plus, with easy access to the third row and convenient stowage options throughout the cabin, loading up your passengers and gear has never been easier.\nWhether you're planning a family vacation, a group outing with friends, or simply need the flexibility to accommodate extra passengers, the 2022 Land Cruiser Sahara's seven-seat configuration offers the perfect blend of luxury, versatility, and practicality. Renting the Land Cruiser Sahara ensures that everyone travels in style and comfort, making every journey an unforgettable adventure for you and your passengers.\nThis car is perfect for road trips! Fits 7 comfortably , Has rear seat entertainment , Apple carplay , Android Auto , Sunroof , Heat and Cool seats , Heated Steering wheel. 360 camera \nPlease note: This car is equipped with a security device that collects driving data. This includes vehicle location, and may include other driving data such as mileage, driving behaviour, and time driven. This information may be shared with third parties for vehicle recovery or insurance purposes. By booking this vehicle you consent to the use of the device.\nExperience this Toyota Landcruiser today !",
      "features": [
        "Automatic transmission",
        "All-wheel drive",
        "Android Auto",
        "Apple CarPlay",
        "AUX input",
        "Backup camera",
        "Blind spot warning",
        "Bluetooth",
        "GPS",
        "Heated seats",
        "Keyless entry",
        "Ski rack",
        "Sunroof",
        "Must be  25+ to book",
        "USB charger",
        "USB input"
      ],
      "pricePerDay": 229,
      "heroImageUrl": "/img/car/toyota-landcruiser-2022.png",
      "cardImageUrl": "/img/car-cards/toyota-landcruiser-2022.png",
      "listingImagesDir": "/img/listing/toyota-landcruiser-2022",
      "listingImages": {
        "mainImage": "/img/listing/toyota-landcruiser-2022/main.jpg",
        "subImagesCount": 15
      }
    }
  }